/*Благ број е број што е составен само од парни цифри (0, 2, 4, 6, 8). 
Во зададен опсег (почетокот m и крајот на опегот n се цели броеви чија вредност 
се внесува од тастатура),
 да се најде и испечати најмалиот „благ број“.
  Ако не постои таков број, да се испечати NE.*/

  #include <stdio.h>
int main(){
    int m,n,i,tmp,tmp_c,f=1;
    scanf("%d %d", &m, &n);
    for(i=m; i<=n; i++) {
        tmp=i;
        while(tmp) {
            tmp_c=tmp%10;
            if(tmp_c%2==0) {
                tmp/=10;
                f=1;
            }
            else {
                f=0;
                break;
            }
        }
        if(f) {
            printf("%d", i);
            break;
        }
    }
    if(!f)
        printf("NE");
    return 0;
}
