/*
Во државата X е воведен прогресивен данок на личен доход. 
Потребно е да напишете програма која ќе им помогне на вработените во 
УЈП на државата X да го пресметува данокот на определен граѓанин. 

Од стандарден влез најпрво се читаат 5 броеви 
процент0,праг1,процент1,праг2,процент2 а потоа 
се чита и износот на примањата на граѓанинот.

На екран треба да се испечати износот на данокот на личниот 
доход пресметан со прогресивна стапка.

Објаснување за примерот.
процент 0 = 10%
праг 1 = 1000 
процент 1 = 20%
праг 2 = 2000
процент 2 = 30%

износ на примања = 3800.

Првите 1000 се оданочуваат со стапка 10%, па наредните 1500 се 
оданочуваат со 20% и останатите 1300 се оданочуваат со 30%. 
Резултат = 1000*0.1+1500*0.2+1300*0.3 = 790.
*/

#include<stdio.h>

int main() {
    int procent0, prag1, prag2, procent1, procent2, iznos;
    scanf("%d %d %d %d %d %d", &procent0, &prag1, &procent1, &prag2, &procent2, &iznos);

    float danok_total = 0;

    int zaProcent0 = iznos >= prag1 ? prag1 : iznos;
    int zaProcent1=0, zaProcent2=0;

    if (iznos>prag1 && iznos<=prag2){
        zaProcent1 = iznos - prag1;
    }
    if (iznos>prag2){
        zaProcent1 = prag2-prag1;
        zaProcent2 = iznos-prag2;
    }

    printf("%.2f", zaProcent0*procent0/100.0 + zaProcent1*procent1/100.0 + zaProcent2*procent2/100.0);


    return 0;
}