/*
Од тастатура се чита еден 2-цифрен број. 
Да се формира број чиј што цифри ќе бидат подредени од десно кон 
лево во растечки редослед.и да се испечати на екран неговиот степен.

Пример: Од бројот 12 треба да се формира бројот 21 и да 
се испечати на екран неговиот степен (441).

Напомена: Бројот секогаш ќе е двоцифрен.*/

#include <stdio.h>

int main() {
    int x;
    scanf("%d", &x);
    int c1 = x % 10;
    int c2 = x / 10;
    int num = 0;
    if (c1 > c2) {
        num = c1 * 10 + c2;
    } else {
        num = c2 * 10 + c1;
    }
    
    printf("%d", num * num);
}