/*
Од населбата каде што живее Мила до факултетот има само две автобуски линии. 
Едната автобуска линија застанува на P постојки по времетраење од М минути и 
се движи со К километри во минута, притоа во просек измеѓу секоја постојка 
на семафор чека С минути. Додека другата се движи по различна рута и застанува 
на D постојки, на секоја постојка чека Z минути, се движи со V километри во 
минута и измеѓу секоја постојка чека на семафор R минути. Ваша задача е за 
даден број на километри до дестинацијата да пресметате со кој автобус побрзо 
ќе стигне Мила до факултетот.

Влез: Во првата линија е даден бројот на километри до дестинацијата. 
Во наредната линија се дадени P,M, K, C. Во третата линија се дадени D, Z, V, R.

Излез: Во првиот ред се печати времетраењето на возењето до факултетот во минути 
со првиот и вториот автобус со празно место. А во втората линија се печати 1 ако 
првиот автобус побрзо стигнува до факултетот, 0 ако побавно стигнува до факултетот.

Пример: За влезот
10
12 2 0.5 3
9 4 0.6 2
Се добива дека првиот автобус ќе стигни за:
 12*2 + (12-1)*3 + 10/0.5 = 77 минути
Вториот автобус ќе стигни за: 9*4 + (9-1)*2 + 10/0.6 = 68 минути*/

#include <stdio.h>
#include <stdlib.h>

int main()
{
    int distance;
    int bus_stops1, waits1, traffic_light1;
    float speed1;
    int bus_stops2, waits2, traffic_light2;
    float speed2;

    scanf("%d", &distance);
    scanf("%d%d%f%d", &bus_stops1, &waits1, &speed1, &traffic_light1);
    scanf("%d%d%f%d", &bus_stops2, &waits2, &speed2, &traffic_light2);

    int t1, t2;
    t1 =  bus_stops1*waits1 + (bus_stops1-1)*traffic_light1 + distance/speed1;
    t2 =  bus_stops2*waits2 + (bus_stops2-1)*traffic_light2 + distance/speed2;

    printf("%d %d\n%d", t1, t2, t1<t2);

    return 0;
}
