/*
Од стандарден влез се чита број x кој означува колку километри траело едно возење со такси. 
На екран треба да се испечати вкупната цена која што клиентот треба да ја плати. 
Првите 5км имаат фиксна цена од 80ден, 
за следните 3км се наплаќа по 20ден по километар и 
за сите останати километри кои ќе бидат поминати се 
наплаќа 25ден по километар. Доколку се поминати 5км или 
помалку од 5км тогаш крајната цена е ослободена од ДДВ, 
а во спротивно треба да се наплати и ДДВ од 20%.*/

#include <stdio.h>

int main(){
   int x;
   float total=80;
   scanf("%d", &x);
   x-=5;
   if(x>=3)
   {
       total=total+3*20;
       x-=3;
   }
   else if(x<3)
   {
       total=total+x*20;
       x=0;
   }
   if(x>0)
   {
       total=total+x*25;
   }
   if(total>80)
   {
       total=total+total*0.2;
   }
   printf("%.0f denari", total);
    return 0;
}
