/*
Од стандарден влез се внесуваат број x и n, па потоа n цели броеви. 
Да се провери дали бројот x се содржи во внесените n броеви од тастатура. 
Секогаш x ќе биде помал од внесените n броеви после него.
Броевите што го исполнуваат условот да се испечатат на екран. 
Доколку нема такви да се испечати Nema.

Пример: Најпрво се внесуваат x и n (нека x = 23, n = 4). 
Потоа се внесуваат n (во случајов 4) броеви од 
тастатура (нека бидат 1234, 2333, 1122, 1114455). 
Броевите што треба да се испечатат на екран се:
1234, 2333, затоа што во нив го содржат бројот х (во случајов 23).*/

#include <stdio.h>

int main() {
    int x, n, i;
    scanf("%d%d", &x, &n);
    int divider = 1;
    int temp = x;
    int flag = 0;
    while(temp) {
        divider *= 10;
        temp /= 10;
    }
    for (i = 0; i < n; i++) {
        int num;
        scanf("%d", &num);
        temp = num;
        while(temp) {
            if (temp % divider == x) {
                printf("%d\n", num);
                flag = 1;
                break;
            }
            temp /= 10;
        }
    }
    if (!flag) printf("Nema");
    return 0;
}