/*
Од стандарден влез се читаат два броја m и n. 
Да се напише програма која што ќе ги испечати факториелите на броевите во опсегот (m, n].

Објаснување: Факториел на даден број се пресметува: 3! = 3*2*1 = 6

Напомена: За да го сместите резултатот од добиениот факториел користете 
long репрезентација на број. За печатење на истиот се користи %ld. 
*/

#include <stdio.h>

int main(){
    int m, n, i, j;
    long fact;

    scanf("%d %d", &m, &n);

    for(i=m+1; i<=n; i++)
    {
        fact = 1l;

        for( j=1; j<=i; j++)
        {
            fact = fact * j;
        }
	  printf("Faktoriel od %d e %ld.\n", i, fact);
        
    }

    return 0;
}
