/*
Со Морзеовата азбука, знаците (букви, цифри) се претставуваат со точки и цртички. 
Цифрите од 0 до 4 се претставуваат, соодветно, 
на следниот начин: "-----", ".----", "..---", "...--", "....-". 
Од тастатура се внесува даден природен број N (N<100 000), 
и потоа се внесуваат N други природни броеви. За секој од внесените броеви, 
во посебен ред, да се отпечати остатокот при делењето на тој број со 5 во Морзеов код.
*/

#include <stdio.h>

int main() {

    char * morse_code[] = {
            "-----",
            ".----",
            "..---",
            "...--",
            "....-",
    };

    int n, i, current_number, rest;

    scanf("%d", &n);

    for (i = 0; i < n; ++i) {
        scanf("%d", &current_number);
        rest = current_number % 5;
        printf("%s\n", morse_code[rest]);
    }

    return 0;
}
