/*

Полу-елка се црта со ѕвездички (*) и прачки (|) на следниот начин:

*
|
|**
|
|***
|
|****

Значи, во првиот ред има ѕвездичка. 
Во следниот ред има прачка. 
Понатаму преку еден ред имаме или само прачка или прачка 
со неколку ѕвездички (една повеќе отколку во прет-претходниот ред). 
Полу-елката завршува со ред во кој има една прачка и N ѕвездички.

За дадено N, отпечатете ја полу-елката според описот.

За N=4, треба на излез да се добие како примерот погоре.*/

#include<stdio.h>

int main(){
    int i, j, s=0, N;
    scanf("%d", &N);
    for(i = 0; i < 2*N-1; i++){
        for(j = 0; j <= N; j++){
            if(i == 0){
                printf("*");
                s = 1;
                break;
            }
            else if(i%2){
                printf("|");
                break;
            }
            else if(!(i%2)){
                if(j == 0) printf("|");
                else if(j <= s + 1) printf("*");
                else { s++; break;}
            }
        }
        printf("\n");
    }
    return 0;
}