/*
Среден број е број кај кој секоја следна цифра е помала на претходната 
(гледајќи од најзначајната кон најмалку значајната). На пример, 7421. 
Едноцифрените броеви не се средни броеви.

Да се напише програма во која прво се внесува број N кој го 
определува вкупниот број на броеви кои ќе бидат внесени од тастатура. 
Потоа се внесуваат N-те броеви, еден по еден. 
На излез, потребно е да се испечатат сите броеви кои го исполнуваат 
условот за среден број, а потоа да се отпечати и минималниот среден 
број од внесените броеви.

Доколку не постои број кој го задоволува условот се печати вредност -1.
*/

#include<stdio.h>

int main(){
    int num, i, tmp, min=-1, N;
    scanf("%d", &N);
    for(i = 0; i < N; i++){
        scanf("%d", &num);
        tmp = num;
        while(tmp > 9){
            if(tmp%10 >= (tmp/10)%10) break;
            tmp/=10;
        }
        if(tmp < 10){
            printf("%d\n", num);
            if(min == -1) min = num;
            else if(num < min) min = num;
        }
    }
    printf("%d",min);
    return 0;
}