/*
Се внесува време во македонска форма (3 вредности: 
час - од 0 до 23, минути – од 0 до 59, и секунди – од 0 до 59). 
Да се презентира времето во интернационална форма во која 
за 0 часот стои 12, од 13 часот до 23 се всушност од 1 до 11, 
а на крајот стои AM доколку времето е претпладне (од 0:00:00 до 11:59:59) 
и PM доколку времето е попладне (од 12:00:01 до 23:59:59). 
За времето на пладне (12:00:00) после него се печати NOON.

Формата за точен излез може да се види во тест примерите.
*/

#include <stdio.h>

void convertTime(int hh, int mm, int ss){
    if (hh == 12 && mm == 0 && ss == 0) {
        printf("%02d:%02d:%02dNOON",hh,mm,ss);
    } else if (hh==12) {
        printf("%02d:%02d:%02dPM",hh,mm,ss);
    } else if (hh>12) {
        printf("%02d:%02d:%02dPM",hh-12,mm,ss);
    } else if (hh==0){
        printf("%02d:%02d:%02dAM",12,mm,ss);
    } else {
        printf("%02d:%02d:%02dAM",hh,mm,ss);
    }
}

int main() {

    int hh, mm, ss;

    scanf("%d%d%d", &hh, &mm, &ss);

    convertTime(hh, mm, ss);

    return 0;
}
