/*
Даден е правоаголник кој се наоѓа во првиот квадрант 
од координатниот систем и страните му се паралелни со оските. 
Правоаголникот се задава со координатите на долното лево и 
горното десно теме (темињата А и С) кои се цели броеви. 
Потоа, се внесуваат координатите на две точки. 
Вашата програма за секоја од двете точки на излез 
треба да отпечати DA, ако дадената точка лежи врз 
правоаголникот (во правоаголникот и на страните) и 
NE ако е надвор од него.
*/

#include <stdio.h>

int checkPoint(int x, int y, int xa, int ya, int xc, int yc){
    return (x >= xa && x <= xc && y >= ya && y<=yc);
}

int main() {

    int xa, ya, xc, yc, xp1, yp1, xp2, yp2;

    scanf("%d%d%d%d%d%d%d%d", &xa, &ya, &xc, &yc, &xp1, &yp1, &xp2, &yp2);

    printf("%s\n", checkPoint(xp1, yp1, xa, ya, xc, yc) ? "DA" : "NE");
    printf("%s", checkPoint(xp2, yp2, xa, ya, xc, yc) ? "DA" : "NE");

    return 0;
}
