/*
Од тастатура се читаат 2 позитивни цели броеви. 
Доколку се внесе барем еден негативен број или 0 треба да се печати „Invalid input“.

Треба да се определи дали помалиот број “е парен еквивалент” од поголемиот број.

Еден број “е парен еквивалент” на друг број,
 ако и само ако неговите цифри се наоѓаат на парните позиции од другиот број, 
 во истиот редослед. Соодветно да се испечатат пораки „PAREN“ и „NE“.

Позициите треба да се сметаат оддесно-налево 
(најмалку значајната цифра е на позиција 1)*/

#include <stdio.h>
int main(){
    int x,y,tmp;
    scanf("%d %d", &x, &y);
    if(x<=0 || y<=0){
        printf("Invalid input");
    }
        else{
            if(x<y){
                tmp=x;
                x=y;
                y=tmp;
            }
            while(y){
                if(y%10 != (x/10%10))
                    break;
                y/=10;
                x/=100;
            }
            if(!y){
                printf("PAREN");
            }
            else printf("NE");
        }
    return 0;
}

