/*
Од стандарден влез се внесуваат два цели броја N и Х.

Да се најде најблискот број помал од N коj е тотално различен од бројот Х.

Еден број е тотално различен од друг ако и само ако во него не се 
појавува ниту една од цифрите на другиот број.

Задачата да се реши без употреба на низи и матрици.*/

#include <stdio.h>

int main(){
    int n,x;
    scanf("%d%d",&n,&x);
    n--;
    for(;n>=0;n--){
        int tempn=n,tempx=x,f=0;
        while(tempn){
            while(tempx){
                if(tempx%10==tempn%10)f=1;
                tempx/=10;
            }
            tempn/=10;
            tempx=x;
            
        }
       if(!f){printf("%d",n);break;}
    } 
return 0;
}