/*
Од стандарден влез се читаат непознат број на хексадецимални 
цифри се додека не се внесе точка (.). 
Ваша задача е да го пресметате декадниот збир на внесените хексадецимални цифри. 
Доколку добиениот декаден збир е делив со 16 се печати Pogodok. 
Доколку истиот тој збир покрај што е делив со 16 плус завршува на 16 
(последните цифри му се 1 и 6), се печати Poln pogodok инаку се печати самиот збир.

Пример:

влез: A 7 F 2 0 c A 5

излез: 61

(61 = 10 + 7 + 15 + 2 + 0 + 12 + 10 + 5, 
бројот не е делив со 16, ниту пак последните цифри му се 1,6)*/

#include <stdio.h>
int main(){
    char c;
    int suma=0,f=1;
    while(f){
        scanf("%c", &c);
        if(c=='.') f=0;
        if(c>='0' && c<='9') suma+= c - '0';
        else if(c>='a' && c<='f') suma+=10 + c - 'a';
        else if(c>='A' && c<='F') suma+=10 + c - 'A';
    }
    
    if(suma%16==0 && suma%100==16) printf("Poln pogodok");
    else if(suma%16==0 ) printf("Pogodok");
    else printf("%d", suma);
    
    return 0;
}