/*
 Да се напише програма во која се вчитува матрица од
 цели броеви A со N редици и N * 2 колони (N не е поголемо од 50).
 Програмата треба да ја трансформира вчитаната матрица во нова матрица B,
 така што сите елементи десно од N-тата колона ќе ги префрли под N-тата редица,
 односно од матрица со димензија N редици и 2 * N колони ќе се добие матрица со 2 * N редици x N колони.

Пример за N = 3 Влез:

3

1   2   3   4   5   6
7   8   9   10  11  12
13 14  15   16  17  18

Излез:
1    2   3
7    8   9
13  14  15
4    5   6
10  11  12
16  17  18


For example:

Input
8
62  46  55  83  86  67  19  67  21  90  8  19  37  39  45  54
2  67  75  82  4  85  28  36  37  48  85  76  59  20  99  100
21  68  90  22  6  62  69  54  49  52  31  69  40  35  87  3
41  26  3  10  19  93  47  19  16  22  32  8  8  63  94  49
20  67  79  73  13  11  64  75  98  47  7  19  14  67  11  84
5  40  13  42  61  19  61  11  92  93  45  54  74  54  34  94
54  70  86  29  60  27  12  25  41  63  45  32  67  7  38  51
61  94  98  61  6  11  100  90  82  11  27  99  65  35  1  57

Result
62 46 55 83 86 67 19 67
2 67 75 82 4 85 28 36
21 68 90 22 6 62 69 54
41 26 3 10 19 93 47 19
20 67 79 73 13 11 64 75
5 40 13 42 61 19 61 11
54 70 86 29 60 27 12 25
61 94 98 61 6 11 100 90
21 90 8 19 37 39 45 54
37 48 85 76 59 20 99 100
49 52 31 69 40 35 87 3
16 22 32 8 8 63 94 49
98 47 7 19 14 67 11 84
92 93 45 54 74 54 34 94
41 63 45 32 67 7 38 51
82 11 27 99 65 35 1 57

 */

#include <stdio.h>

int main() {
    int a[100][100];
    int b[100][100];
    int n;
    scanf("%d", &n);
    int i, j;
    for (i = 0; i < n; ++i) {
        for (j = 0; j < n * 2; ++j) {
            scanf("%d", &a[i][j]);
        }
    }

    for (i = 0; i < n; ++i) {
        for (j = 0; j < n; ++j) {
            b[i][j] = a[i][j];
        }
    }
    for (i = 0; i < n; ++i) {
        for (j = n; j < 2 * n; ++j) {
            b[n + i][j - n] = a[i][j];
        }
    }

    for (i = 0; i < 2 * n; ++i) {
        for (j = 0; j < n; ++j) {
            printf("%d ", b[i][j]);
        }
        printf("\n");
    }
    return 0;
}
