/*
 Oд стандарден влез се вчитува еден цел број X,
 димензии на матрица M и N (цели броеви),
 како и елементите на матрицата со димензии M x N (цели броеви).
 Да се напише програма што ќе ги промени редиците на матрицата на следниот начин:

Ако збирот на елементите од редот е поголем од X, елементите на тој ред добиваат вредност 1
Ако збирот на елементите од редот е помал од X, елементите на тој ред добиваат вредност -1
Ако збирот на елементите од редот е еднаков на X, елементите на тој ред добиваат вредност 0
Променетата матрица да се испечати на екран.

Пример.

Влез:

31

4    2    7    11
3    8   16     1
17   8    9     5
6   14    4     7
5   15    5     6

Излез:

-1  -1  -1  -1
-1  -1  -1  -1
 1   1   1   1
 0   0   0   0
 0   0   0   0

For example:

Input
17
4 6
1 5 7 2 1 1
10 0 0 5 1 1
5 8 3 9 1 0
9 8 2 5 3 4

Result
0 0 0 0 0 0
0 0 0 0 0 0
1 1 1 1 1 1
1 1 1 1 1 1

 */

#include <stdio.h>

#define MAX 100

int main() {
    int i, j, m, n, a[MAX][MAX], sum = 0, broj;
    scanf("%d", &broj);
    scanf("%d %d", &m, &n);
    for (i = 0; i < m; i++)
        for (j = 0; j < n; j++)
            scanf("%d", &a[i][j]);
    for (i = 0; i < m; i++) {
        sum = 0;
        for (j = 0; j < n; j++) {
            sum += a[i][j];
        }

        if (sum > broj)
            for (j = 0; j < n; j++) {
                a[i][j] = 1;
            }
        else if (sum < broj)
            for (j = 0; j < n; j++) {
                a[i][j] = -1;
            }
        else
            for (j = 0; j < n; j++) {
                a[i][j] = 0;
            }
    }

    for (i = 0; i < m; i++) {
        for (j = 0; j < n; j++) {
            printf("%d ", a[i][j]);
        }
        printf("\n");
    }
    return 0;
}