/*
 Да се напише рекурзивна функција за наоѓање на максималната цифра од даден цел број.

Од стандарден влез се внесуваат непознат број цели броеви се додека не се внесе нешто што не е број.
 За секој од нив да се испечати максималната цифра во посебен ред.

Забелешка: Решението со рекурзивна функција носи 100% од поените, а со нерекурзивна функција 70% од поените.

Забелешка: ЗАБРАНЕТО е користење на глобални променливи.

For example:

Input
5128
4126
7258
4000
4500
6882
7762
3900
4100
4400
4897
6000
7000
7500
8002
3000
3910
4090
4110
4202
4490
4800
5000
5990
6500
6905
7010
7400
7600
8000
8005
2999
3001
3905
3999
5128
4126
7258
4000
4500
6882
7762
3900
4100
4400
4897
6000
7000
7500
8002
3000
3910
4090
4110
4202
4490
4800
5000
5990
6500
6905
7010
7400
7600
8000
8005
/

Result
8
6
8
4
5
8
7
9
4
4
9
6
7
7
8
3
9
9
4
4
9
8
5
9
6
9
7
7
7
8
8
9
3
9
9
8
6
8
4
5
8
7
9
4
4
9
6
7
7
8
3
9
9
4
4
9
8
5
9
6
9
7
7
7
8
8

 */

#include <stdio.h>

int maxDigit(int n) {
    int a, b;

    if (n == 0)
        return 0;
    else {
        a = n % 10;
        b = maxDigit(n / 10);
        if (a > b)
            return a;
        else
            return b;
    }
}


int main() {
    int n;
    while (scanf("%d", &n)) {
        printf("%d\n", maxDigit(n));
    }
    return 0;
}