/*
 Од стандарден влез се чита природен број N (N <= 100), како и низа a[ ] од N цели броеви.

Да се напише функција void premesti(а, n)
која го преместува секој пронајден негативен број на крајот на низата.
По преместувањето редоследот на позитивните броеви треба да остане ист како и во оригиналната низа,
а истото важи и за редоследот на негативните.

Нaпишете програма која ќе ја повика функцијата premesti за
внесената низа a[ ] и потоа ќе ја испечати новодобиената низа.

Пример.

Влез

9 // бројот N на елементи

1 3 -3 2 5 -7 9 0 3 // елементи на низата


Излез

1 3 2 5 0 3 -3 -7 -9 // добиената низа, после преместувањето

For example:

Input	Result
9       1 3 -3 2 5 -7 -9 0 3
        1 3 2 5 0 3 -3 -7 -9

Input	Result
10      8 1 5 7 10 100 36 85 14 2
        8 1 5 7 10 100 36 85 14 2

 */

void premesti(int a[], int n) {
    int result[n];

    int i, j = 0;
    for (i = 0; i < n; i++)
        if (a[i] >= 0)
            result[j++] = a[i];
    if (j == n || j == 0)
        return;
    for (i = 0; i < n; i++)
        if (a[i] < 0)
            result[j++] = a[i];
    for (i = 0; i < n; i++)
        a[i] = result[i];
}

int main() {
    int n, i;
    scanf("%d", &n);
    int niza[n];
    for (i = 0; i < n; i++)
        scanf("%d", &niza[i]);
    premesti(niza, n);
    for (i = 0; i < n; i++)
        printf("%d ", niza[i]);
    return 0;
}