/*
 Од стандарден влез се чита матрица со 10 редови и 10 колони.
 Потоа се читаат 10 броеви со вредности од 1 до 4.
За i-тата колона од матрицата треба да пресметате и отпечатите:

доколку i-тиот број е 1: збир на елементите во колоната;
доколку i-тиот број е 2: средна вредност на елементите во колоната;
доколку i-тиот број е 3: најголемиот број во колоната;
доколку i-тиот број е 4: најмалиот број во колоната;
For example:

Input	                  Result
1 7 4 0 9 4 8 8 2 4       4.90 1 0 9 52 9 4.50 9 5.10 8
5 5 1 7 1 1 5 2 7 6
1 4 2 3 2 2 1 6 8 5
7 6 1 8 9 2 7 9 5 4
3 1 2 3 3 4 1 1 3 8
7 4 2 7 7 9 3 1 9 8
6 5 0 2 8 6 0 2 4 8
6 5 0 9 0 0 6 1 3 8
9 3 4 4 6 0 6 6 1 8
4 9 6 3 7 8 8 2 9 1

2 4 4 3 1 3 2 3 2 3
 _______________________________________________

Input	                             Result
-7 7 -10 9 9 -14 11 -14 11 8         -20 35 -10 50 -3.80 14 11 7 -13 -0.30
8 10 0 -2 -3 -7 -13 -10 8 -9
-14 13 -9 7 -14 -11 -9 -13 4 -14
0 5 -2 11 -1 14 -3 -6 -12 -1
9 5 -10 -6 1 -12 -11 -13 -7 -7
-8 -10 3 -4 -13 10 2 -11 -1 9
9 -1 -3 14 -2 5 2 -8 3 2
-2 5 8 13 -13 -10 -3 5 8 -8
-13 4 2 0 -2 -11 -2 -13 -4 6
-2 -3 0 8 0 -4 -13 7 -13 11

1 1 4 1 2 3 3 3 4 2
 */

#include<stdio.h>

int main() {
    int matrix[10][10];
    int i, j;
    for (i = 0; i < 10; i++) {
        for (j = 0; j < 10; j++) {
            scanf("%d", &(matrix[i][j]));
        }
    }
    int sum, mx, mn;
    float avg;
    for (j = 0; j < 10; j++) {
        int x;
        scanf("%d", &x);
        switch (x) {
            case 1:
                sum = 0;
                for (i = 0; i < 10; i++) {
                    sum += matrix[i][j];
                }
                printf("%d ", sum);
                break;
            case 2:
                avg = 0;
                for (i = 0; i < 10; i++) {
                    avg += matrix[i][j];
                }
                printf("%.2f ", avg / 10);
                break;
            case 3:
                mx = matrix[0][j];
                for (i = 0; i < 10; i++) {
                    if (matrix[i][j] > mx) mx = matrix[i][j];
                }
                printf("%d ", mx);
                break;
            case 4:
                mn = matrix[0][j];
                for (i = 0; i < 10; i++) {
                    if (matrix[i][j] < mn) mn = matrix[i][j];
                }
                printf("%d ", mn);
                break;
            default:
                break;
        }
    }
    return 0;
}