/*
 Од стандарден влез се чита низа на цели броеви се додека не се внесе нешто различно од цел број.
 Треба да се направи трансформација на низата, на тој начин што за секој елемент,
 сите елементи после него кои што се еднакви со него ќе се зголемат за разликата на
 позициите помеѓу двата елементи.

 Пример: - Низата 5 6 10 5 3 10 10, после трансформација би била 5 6 10 8 3 13 14.

For example:

Input	Result
5       5 6 10 7 3 13 14
6
10
7
3
10
10
*

*/

#include <stdio.h>

#define MAX 100

int main() {
    int array[MAX], i, j, broj, n = 0;

    while (scanf("%d", &broj)) {
        array[n++] = broj;
    }

    for (i = 0; i < n - 1; i++) {
        for (j = i + 1; j < n; j++) {
            if (array[i] == array[j]) {
                array[j] += (j - i);
            }
        }
    }

    for (i = 0; i < n; i++) {
        printf("%d ", array[i]);
    }

    return 0;
}