/*
 Од стандарден влез се внесува број n (димензии за квадратна матрица).
 Потоа се внесува матрицата. Да се трансформира матрицата така што секој елемент кој
 се наоѓа во исто време под главната и споредната дијагонала во обратен број. Обратен
 број на некој број е ако тој е позитивен да се претвори во негативен број,
 а ако бројот е негативен да се претвори во позитивен број.

Објаснување за првиот тест пример броевите што се задебелени се наоѓаат под
 главната и споредната дијагонала.

1 2 3 4 5
1 2 3 4 5
1 2 3 4 5
1 2 3 4 5
1 2 3 4 5

For example:

Input
5
1 2 3 4 5
1 2 3 4 5
1 2 3 4 5
1 2 3 4 5
1 2 3 4 5

Result
1 2 3 4 5
1 2 3 4 5
1 2 3 4 5
1 2 -3 4 5
1 -2 -3 -4 5


 */

#include<stdio.h>

int main() {
    int n;
    scanf("%d", &n);
    int a[n][n];

    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            scanf("%d", &a[i][j]);
        }
    }

    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            if (i > j && j > n - 1 - i) {
                a[i][j] *= (-1);
            }
        }
    }

    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            printf("%d ", a[i][j]);
        }
        printf("\n");
    }
}
