/*
 Од стандарден влез се вчитува матрица сo n редици и n колони.
 Прво се вчитува бројот n потоа и елементите на матрицата.
 Матрицата треба да се трансформира така што секој елемент што се наоѓа десно
 од споредната дијагонала од истата редица и е помал од просекот на елементите
 лево од споредната дијагонала од истата редица треба да се замени со -1.
 Вака трансформираната матрица да се испечати на екран.

Објаснување на примерот:

2 3 5 9

7 8 4 2

4 2 3 5

7 10 9 2

Пример за втората редица, елементот од споредната дијагонала е 4,
 лево од него се 7 и 8, нивен просек е 7.5 , десно од него е 2, 2 е
 помал од 7.5 и затоа се заменува со -1.

For example:

Input
4
2 3 5 9
7 8 4 2
4 2 3 5
7 10 9 2

Result
2 3 5 9
7 8 4 -1
4 2 -1 5
7 10 9 2

 */

#include <stdio.h>

int main() {
    int n;
    scanf("%d", &n);
    float m[n][n];
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++)
            scanf("%f", &m[i][j]);
    }
    for (int i = 0; i < n; i++) {
        float avg = 0.0;
        int count = 0, flag = 0;
        for (int j = 0; j < n; j++) {
            if (i + j == n - 1) {
                flag = 1;
                avg /= count;
            }
            if (flag == 0) {
                avg += m[i][j];
                ++count;
            }
            if (flag == 1 && m[i][j] < avg && i + j != n - 1) {
                m[i][j] = -1;
            }
            printf("%.0f ", m[i][j]);
        }
        printf("\n");
    }
    return 0;
}
