/*
 Се чита низа од n цели броеви.
 Провери дали низата е специјална.
 Ако од сите броеви на парни позиции 50% или повеќе се парни броеви,
 и од сите броеви на непарна позиција 30% или помалку се непарни броеви, тогаш низата е специјална.
 Испечати 1 ако е низата специјална, испечати 0 ако не е.



For example:

Input	Result
5       0
2
4
3
5
2

Input	Result
12      0
3
2
4
5
3
1
9
6
5
4
3
5

 */

#include <stdio.h>

int main() {
    int n, i;

    scanf("%d", &n);

    int a[n];

    for (i = 0; i < n; i++) {
        scanf("%d", &a[i]);
    }

    int c1 = 0, c2 = 0, c3 = 0, c4 = 0;

    for (i = 0; i < n; i += 2) {
        if (a[i] % 2 == 0)
            c1++;


        c2++;
    }


    for (i = 1; i < n; i += 2) {
        if (a[i] % 2 == 1)
            c3++;


        c4++;
    }


    if ((float) c1 / (float) c2 >= 0.5 &&
        (float) c3 / (float) c4 <= 0.3)
        printf("1");
    else {
        printf("0");
    }

}
