/*
Од тастатура во низа се внесуваат N позитивни цели броеви (N <= 100),
 а потоа се внесува и цел број ind (ind >= 0).

Да се напише функција sum_pos која ја прима низата,
 бројот ind (кој претставува индекс во низата) и бројот на валидни елементи во низата.
 Функцијата треба да врати сумата на сите елементи почнувајќи
 од дадениот индекс ind па се до крајот на низата.
 Ако индексот ind е поголем од Nфункцијата треба да врати 0.

НАПОМЕНА: Задачата да се реши со помош на покажувачи (без користење на оператор [ ]).

Пример

влез:

10
2 4 6 8 1 3 9 12 33 44
6
излез:

98
98 = 9+12+33+44

For example:

Input	                Result
6                       2
2 1 66 100 1 2
5
 */

#include <stdio.h>
#include <stdlib.h>

int sum_pos(int *a, int n, int ind) {
    int *p, sum = 0;

    for (p = (a + ind); p < (a + n); ++p) {
        sum += *p;
    }
    return sum;
}


int main() {
    int a[100], N, i, ind;

    scanf("%d", &N);

    for (i = 0; i < N; ++i) {
        scanf("%d", &a[i]);
    }

    scanf("%d", &ind);

    printf("%d", sum_pos(a, N, ind));

    return 0;

}