/*
 Да се напише програма која вчитува квадратна матрица.
 На почетокот се внесува бројот на редици и колони N на матрицата,
 а потоа и елементите на матрицата.
 Да се трансформира матрицата на тој начин што секој негативен број во неа би се
 заменил со збирот на неговите соседи. Соседи на даден број во матрица се броевите до него
 (гледано хоризонтално и вертикално).

For example:

Input
4
5
6
7
8
20
-1
4
3
50
1
2
-6
5
-8
5
4

Result
5 6 7 8
20 31 4 3
50 1 2 9
5 11 5 4
 */

#include <stdio.h>

int main() {
    int n, a[100][100], i, j, zbirSosedi;
    scanf("%d", &n);

    for (i = 0; i < n; i++) {
        for (j = 0; j < n; j++) {
            scanf("%d", &a[i][j]);
        }
    }

    for (i = 0; i < n; i++) {
        for (j = 0; j < n; j++) {
            zbirSosedi = 0;
            if (a[i][j] < 0) {
                if (i > 0)
                    zbirSosedi += a[i - 1][j];

                if (i < n - 1)
                    zbirSosedi += a[i + 1][j];

                if (j > 0)
                    zbirSosedi += a[i][j - 1];

                if (j < n - 1)
                    zbirSosedi += a[i][j + 1];

                a[i][j] = zbirSosedi;
            }
        }
    }

    for (i = 0; i < n; i++) {
        for (j = 0; j < n; j++) {
            printf("%d ", a[i][j]);
        }
        printf("\n");
    }

    return 0;
}