/*
 Да се имплементира рекурзивна функција која за низа од цели броеви [a{0}, a{1}, ..., a_{n-1}]
 ќе ја пресмета вредноста на непрекинатата дропка дефинирана како:

СЛИКА: B2B_2023/kolokvium_2/zad8/zad8_slika.png

Да се напише програма во која се чита цел број N,
 по што се читаат елементите на низа од N цели броеви (не повеќе од 100).
 Потоа се повикува рекурзивната функција и се печати резултатот во нов ред.

For example:

Input
50 50 8 43 32 29 4 23 26 17 16 30 16 20 42 41 24 36 27 38 43 22 10 27 14 48 21 20 40 36 13 10 28 33 3 8 3 6 49 23 23 12 31 37 33 12 47 32 42 16 1
Result
50.124638

 */

#include <stdio.h>

#define SIZE 100

double cf(int n, int a[]) {
    if (n == 1)
        return a[0];
    else
        return a[0] + 1 / cf(n - 1, a + 1);
}

int main() {
    int n, i, coef[SIZE];

    scanf("%d", &n);
    for (i = 0; i < n; i++)
        scanf("%d", &coef[i]);
    printf("%f\n", cf(n, coef));

    return 0;
}
