/*
 Од стандарден влез да се вчита број N и потоа да се вчитаат N елементи во една низа.

Внесената низа да се трансформира на начин што парните елементи ќе се зголемат за 1,
 а непарните ќе се намалат за 1.

Трансформираната низа да се испечати на стандарден излез, така што елементите ќе се одвоени
 со празно место меѓу нив.

For example:

Input	     Result
5            0 3 2 5 4
1 2 3 4 5
 */
#include <stdio.h>

int main() {
    int n;
    scanf("%d", &n);
    int niza[n];
    for (int i = 0; i < n; ++i) {
        scanf("%d", &niza[i]);
        if (niza[i] % 2 == 0)
            printf("%d ", niza[i] + 1);
        else printf("%d ", niza[i] - 1);
    }
    return 0;
}